Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEbcu_bf.h
/** \brief Length for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_OFF (20u)

/** \brief Length for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_OFF (21u)

/** \brief Length for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_LEN (6u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_MSK (0x3fu)

/** \brief Offset for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_OFF (22u)

/** \brief Length for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_LEN (4u)

/** \brief Mask for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_OFF (28u)

/** \brief Length for Ifx_EBCU_EADD_Bits.FPIADR */
#define IFX_EBCU_EADD_FPIADR_LEN (32u)

/** \brief Mask for Ifx_EBCU_EADD_Bits.FPIADR */
#define IFX_EBCU_EADD_FPIADR_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBCU_EADD_Bits.FPIADR */
#define IFX_EBCU_EADD_FPIADR_OFF (0u)

/** \brief Length for Ifx_EBCU_EDAT_Bits.FPIDAT */
#define IFX_EBCU_EDAT_FPIDAT_LEN (32u)

/** \brief Mask for Ifx_EBCU_EDAT_Bits.FPIDAT */
#define IFX_EBCU_EDAT_FPIDAT_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBCU_EDAT_Bits.FPIDAT */
#define IFX_EBCU_EDAT_FPIDAT_OFF (0u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.EO */
#define IFX_EBCU_DBCNTL_EO_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.EO */
#define IFX_EBCU_DBCNTL_EO_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.EO */
#define IFX_EBCU_DBCNTL_EO_OFF (0u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.OA */
#define IFX_EBCU_DBCNTL_OA_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.OA */
#define IFX_EBCU_DBCNTL_OA_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.OA */
#define IFX_EBCU_DBCNTL_OA_OFF (1u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.RA */
#define IFX_EBCU_DBCNTL_RA_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.RA */
#define IFX_EBCU_DBCNTL_RA_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.RA */
#define IFX_EBCU_DBCNTL_RA_OFF (4u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.CONCOM0 */
#define IFX_EBCU_DBCNTL_CONCOM0_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.CONCOM0 */
#define IFX_EBCU_DBCNTL_CONCOM0_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.CONCOM0 */
#define IFX_EBCU_DBCNTL_CONCOM0_OFF (12u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.CONCOM1 */
#define IFX_EBCU_DBCNTL_CONCOM1_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.CONCOM1 */
#define IFX_EBCU_DBCNTL_CONCOM1_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.CONCOM1 */
#define IFX_EBCU_DBCNTL_CONCOM1_OFF (13u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.CONCOM2 */
#define IFX_EBCU_DBCNTL_CONCOM2_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.CONCOM2 */
#define IFX_EBCU_DBCNTL_CONCOM2_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.CONCOM2 */
#define IFX_EBCU_DBCNTL_CONCOM2_OFF (14u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONG */
#define IFX_EBCU_DBCNTL_ONG_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONG */
#define IFX_EBCU_DBCNTL_ONG_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONG */
#define IFX_EBCU_DBCNTL_ONG_OFF (16u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONA1 */
#define IFX_EBCU_DBCNTL_ONA1_LEN (2u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONA1 */
#define IFX_EBCU_DBCNTL_ONA1_MSK (0x3u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONA1 */
#define IFX_EBCU_DBCNTL_ONA1_OFF (20u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONA2 */
#define IFX_EBCU_DBCNTL_ONA2_LEN (2u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONA2 */
#define IFX_EBCU_DBCNTL_ONA2_MSK (0x3u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONA2 */
#define IFX_EBCU_DBCNTL_ONA2_OFF (24u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONBOS0 */
#define IFX_EBCU_DBCNTL_ONBOS0_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS0 */
#define IFX_EBCU_DBCNTL_ONBOS0_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS0 */
#define IFX_EBCU_DBCNTL_ONBOS0_OFF (28u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_EBCU_DBCNTL_ONBOS1_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_EBCU_DBCNTL_ONBOS1_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_EBCU_DBCNTL_ONBOS1_OFF (29u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_EBCU_DBCNTL_ONBOS2_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_EBCU_DBCNTL_ONBOS2_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_EBCU_DBCNTL_ONBOS2_OFF (30u)

/** \brief Length for Ifx_EBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_EBCU_DBCNTL_ONBOS3_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_EBCU_DBCNTL_ONBOS3_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_EBCU_DBCNTL_ONBOS3_OFF (31u)

/** \brief Length for Ifx_EBCU_DBGRNT_Bits.IOC32P */
#define IFX_EBCU_DBGRNT_IOC32P_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGRNT_Bits.IOC32P */
#define IFX_EBCU_DBGRNT_IOC32P_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGRNT_Bits.IOC32P */
#define IFX_EBCU_DBGRNT_IOC32P_OFF (0u)

/** \brief Length for Ifx_EBCU_DBGRNT_Bits.IOC32E */
#define IFX_EBCU_DBGRNT_IOC32E_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGRNT_Bits.IOC32E */
#define IFX_EBCU_DBGRNT_IOC32E_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGRNT_Bits.IOC32E */
#define IFX_EBCU_DBGRNT_IOC32E_OFF (3u)

/** \brief Length for Ifx_EBCU_DBGRNT_Bits.CIF */
#define IFX_EBCU_DBGRNT_CIF_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGRNT_Bits.CIF */
#define IFX_EBCU_DBGRNT_CIF_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGRNT_Bits.CIF */
#define IFX_EBCU_DBGRNT_CIF_OFF (4u)

/** \brief Length for Ifx_EBCU_DBGRNT_Bits.SFI_S2F */
#define IFX_EBCU_DBGRNT_SFI_S2F_LEN (1u)

/** \brief Mask for Ifx_EBCU_DBGRNT_Bits.SFI_S2F */
#define IFX_EBCU_DBGRNT_SFI_S2F_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_DBGRNT_Bits.SFI_S2F */
#define IFX_EBCU_DBGRNT_SFI_S2F_OFF (6u)

/** \brief Length for Ifx_EBCU_DBADR1_Bits.ADR1 */
#define IFX_EBCU_DBADR1_ADR1_LEN (32u)

/** \brief Mask for Ifx_EBCU_DBADR1_Bits.ADR1 */
#define IFX_EBCU_DBADR1_ADR1_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBCU_DBADR1_Bits.ADR1 */
#define IFX_EBCU_DBADR1_ADR1_OFF (0u)

/** \brief Length for Ifx_EBCU_DBADR2_Bits.ADR2 */
#define IFX_EBCU_DBADR2_ADR2_LEN (32u)

/** \brief Mask for Ifx_EBCU_DBADR2_Bits.ADR2 */
#define IFX_EBCU_DBADR2_ADR2_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBCU_DBADR2_Bits.ADR2 */
#define IFX_EBCU_DBADR2_ADR2_OFF (0u)

/** \brief Length for Ifx_EBCU_DBBOS_Bits.OPC */
#define IFX_EBCU_DBBOS_OPC_LEN (4u)

/** \brief Mask for Ifx_EBCU_DBBOS_Bits.OPC */
#define IFX_EBCU_DBBOS_OPC_MSK (0xfu)

/** \brief Offset for Ifx_EBCU_DBBOS_Bits.OPC */
#define IFX_EBCU_DBBOS_OPC_OFF (0u)

