Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEbcu_bf.h
/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR14 */
#define IFX_EBCU_ALCLR_CLR14_OFF (14u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR15 */
#define IFX_EBCU_ALCLR_CLR15_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR15 */
#define IFX_EBCU_ALCLR_CLR15_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR15 */
#define IFX_EBCU_ALCLR_CLR15_OFF (15u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR16 */
#define IFX_EBCU_ALCLR_CLR16_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR16 */
#define IFX_EBCU_ALCLR_CLR16_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR16 */
#define IFX_EBCU_ALCLR_CLR16_OFF (16u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR17 */
#define IFX_EBCU_ALCLR_CLR17_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR17 */
#define IFX_EBCU_ALCLR_CLR17_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR17 */
#define IFX_EBCU_ALCLR_CLR17_OFF (17u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR18 */
#define IFX_EBCU_ALCLR_CLR18_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR18 */
#define IFX_EBCU_ALCLR_CLR18_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR18 */
#define IFX_EBCU_ALCLR_CLR18_OFF (18u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR19 */
#define IFX_EBCU_ALCLR_CLR19_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR19 */
#define IFX_EBCU_ALCLR_CLR19_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR19 */
#define IFX_EBCU_ALCLR_CLR19_OFF (19u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR20 */
#define IFX_EBCU_ALCLR_CLR20_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR20 */
#define IFX_EBCU_ALCLR_CLR20_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR20 */
#define IFX_EBCU_ALCLR_CLR20_OFF (20u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR21 */
#define IFX_EBCU_ALCLR_CLR21_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR21 */
#define IFX_EBCU_ALCLR_CLR21_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR21 */
#define IFX_EBCU_ALCLR_CLR21_OFF (21u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR22 */
#define IFX_EBCU_ALCLR_CLR22_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR22 */
#define IFX_EBCU_ALCLR_CLR22_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR22 */
#define IFX_EBCU_ALCLR_CLR22_OFF (22u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR23 */
#define IFX_EBCU_ALCLR_CLR23_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR23 */
#define IFX_EBCU_ALCLR_CLR23_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR23 */
#define IFX_EBCU_ALCLR_CLR23_OFF (23u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR24 */
#define IFX_EBCU_ALCLR_CLR24_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR24 */
#define IFX_EBCU_ALCLR_CLR24_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR24 */
#define IFX_EBCU_ALCLR_CLR24_OFF (24u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR25 */
#define IFX_EBCU_ALCLR_CLR25_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR25 */
#define IFX_EBCU_ALCLR_CLR25_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR25 */
#define IFX_EBCU_ALCLR_CLR25_OFF (25u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR26 */
#define IFX_EBCU_ALCLR_CLR26_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR26 */
#define IFX_EBCU_ALCLR_CLR26_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR26 */
#define IFX_EBCU_ALCLR_CLR26_OFF (26u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR27 */
#define IFX_EBCU_ALCLR_CLR27_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR27 */
#define IFX_EBCU_ALCLR_CLR27_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR27 */
#define IFX_EBCU_ALCLR_CLR27_OFF (27u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR28 */
#define IFX_EBCU_ALCLR_CLR28_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR28 */
#define IFX_EBCU_ALCLR_CLR28_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR28 */
#define IFX_EBCU_ALCLR_CLR28_OFF (28u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR29 */
#define IFX_EBCU_ALCLR_CLR29_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR29 */
#define IFX_EBCU_ALCLR_CLR29_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR29 */
#define IFX_EBCU_ALCLR_CLR29_OFF (29u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR30 */
#define IFX_EBCU_ALCLR_CLR30_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR30 */
#define IFX_EBCU_ALCLR_CLR30_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR30 */
#define IFX_EBCU_ALCLR_CLR30_OFF (30u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR31 */
#define IFX_EBCU_ALCLR_CLR31_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR31 */
#define IFX_EBCU_ALCLR_CLR31_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR31 */
#define IFX_EBCU_ALCLR_CLR31_OFF (31u)

/** \brief Length for Ifx_EBCU_ALCTRL_Bits.ALOV */
#define IFX_EBCU_ALCTRL_ALOV_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCTRL_Bits.ALOV */
#define IFX_EBCU_ALCTRL_ALOV_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCTRL_Bits.ALOV */
#define IFX_EBCU_ALCTRL_ALOV_OFF (0u)

/** \brief Length for Ifx_EBCU_ALCTRL_Bits.ALOVCLR */
#define IFX_EBCU_ALCTRL_ALOVCLR_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCTRL_Bits.ALOVCLR */
#define IFX_EBCU_ALCTRL_ALOVCLR_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCTRL_Bits.ALOVCLR */
#define IFX_EBCU_ALCTRL_ALOVCLR_OFF (1u)

/** \brief Length for Ifx_EBCU_FEGEN_Bits.SEDM */
#define IFX_EBCU_FEGEN_SEDM_LEN (3u)

/** \brief Mask for Ifx_EBCU_FEGEN_Bits.SEDM */
#define IFX_EBCU_FEGEN_SEDM_MSK (0x7u)

/** \brief Offset for Ifx_EBCU_FEGEN_Bits.SEDM */
#define IFX_EBCU_FEGEN_SEDM_OFF (0u)

/** \brief Length for Ifx_EBCU_FEGEN_Bits.MEDM */
#define IFX_EBCU_FEGEN_MEDM_LEN (3u)

/** \brief Mask for Ifx_EBCU_FEGEN_Bits.MEDM */
#define IFX_EBCU_FEGEN_MEDM_MSK (0x7u)

/** \brief Offset for Ifx_EBCU_FEGEN_Bits.MEDM */
#define IFX_EBCU_FEGEN_MEDM_OFF (8u)

/** \brief Length for Ifx_EBCU_FEGEN_Bits.EN */
#define IFX_EBCU_FEGEN_EN_LEN (3u)

/** \brief Mask for Ifx_EBCU_FEGEN_Bits.EN */
#define IFX_EBCU_FEGEN_EN_MSK (0x7u)

/** \brief Offset for Ifx_EBCU_FEGEN_Bits.EN */
#define IFX_EBCU_FEGEN_EN_OFF (16u)

/** \brief Length for Ifx_EBCU_FEGEN_Bits.BCU */
#define IFX_EBCU_FEGEN_BCU_LEN (2u)

/** \brief Mask for Ifx_EBCU_FEGEN_Bits.BCU */
#define IFX_EBCU_FEGEN_BCU_MSK (0x3u)

